app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
    def index
      @categories = Category.order(:name)