app/controllers/admin/contact_messages_controller.rb

    def index
      @messages = ContactMessage.order(created_at: :desc)
---
SELECT "contact_messages".* FROM "contact_messages" ORDER BY "contact_messages"."created_at" DESC

    def set_message
      @message = ContactMessage.find(params[:id])
---
SELECT "contact_messages".* FROM "contact_messages" WHERE "contact_messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]