app/controllers/admin/dashboard_controller.rb

    def index
      @orders_count = Order.count
      @products_count = Product.count
      @messages_count = ContactMessage.count
      @pending_reviews = Review.where(approved: false).count
---
SELECT COUNT(*) FROM "orders"
SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "contact_messages"
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."approved" = ?  [["approved", 0]]