app/controllers/admin/orders_controller.rb

    def index
      @orders = Order.includes(:user).order(created_at: :desc)
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC