app/controllers/admin/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?)  [["id", 4], ["id", 3], ["id", 2], ["id", 1]]
SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC
---
    def index
      @products = Product.includes(:category).order(created_at: :desc)

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?
---
    def update
      if @product.update(product_params)