app/controllers/admin/reviews_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 21], ["id", 5]]
SELECT "reviews".* FROM "reviews" ORDER BY "reviews"."created_at" DESC
---
    def index
      @reviews = Review.includes(:user, :product).order(created_at: :desc)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "approved" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["approved", 1], ["updated_at", "2025-12-17 18:40:16.256596"], ["id", 1]]
---
    def update
      review = Review.find(params[:id])
      if review.update(params.require(:review).permit(:approved))