app/views/admin/products/edit.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
    <%= f.label :category_id, "Категорія" %>
    <%= f.collection_select :category_id, Category.order(:name), :id, :name, {}, required: true %>