app/controllers/carts_controller.rb

  def show
    ids = current_cart.keys.map(&:to_i)
    @products = Product.where(id: ids).index_by(&:id)
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 2], ["id", 5]]