app/controllers/checkout_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 2], ["id", 5]]
---
  def new
    redirect_to cart_path, alert: "Кошик порожній" if current_cart.empty?
    @order = Order.new
    ids = current_cart.keys.map(&:to_i)
    @products = Product.where(id: ids).index_by(&:id)

SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 2], ["id", 5]]
INSERT INTO "orders" ("user_id", "total", "status", "delivery_method", "payment_method", "name", "phone", "address", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price_snapshot", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["order_id", 1], ["product_id", 2], ["quantity", 1], ["price_snapshot", 459.0], ["created_at", "2025-12-17 18:39:10.129291"], ["updated_at", "2025-12-17 18:39:10.129291"]]
UPDATE "products" SET "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock", 14], ["updated_at", "2025-12-17 18:39:10.131771"], ["id", 2]]
---
  def create
    cart = current_cart
    redirect_to cart_path, alert: "Кошик порожній" and return if cart.empty?

    order = current_user.orders.new(order_params)

    items = Product.where(id: cart.keys.map(&:to_i))
    total = items.sum do |p|
      qty = cart[p.id.to_s].to_i
      p.price.to_d * qty
    end
    order.total = total
    order.status = (order.payment_method == "card_mock") ? "paid" : "new_order"

    Order.transaction do
      order.save!
      items.each do |p|
        qty = cart[p.id.to_s].to_i
        order.order_items.create!(product: p, quantity: qty, price_snapshot: p.price)
        if p.stock
          new_stock = [p.stock.to_i - qty, 0].max
          p.update!(stock: new_stock)