app/controllers/contact_messages_controller.rb

  def create
    @message = ContactMessage.new(message_params)
    @message.status = "new_msg"
    if @message.save
---
INSERT INTO "contact_messages" ("name", "email", "subject", "body", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"