app/controllers/products_controller.rb

  def index
    @animal = params[:animal].presence
    @categories_all = Category.order(:name)
    @categories = @categories_all
    @categories = @categories.where(animal: @animal) if @animal
    @categories_by_animal = @categories_all.group_by(&:animal)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC

    scope = Product.includes(:category).where(active: true)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?)  [["id", 4], ["id", 3], ["id", 2], ["id", 1]]
SELECT "products".* FROM "products" WHERE "products"."active" = ? AND "products"."category_id" = ? ORDER BY "products"."created_at" DESC  [["active", 1], ["category_id", 4]]

  def show
    @product = Product.includes(:category).find(params[:id])
    @reviews = @product.reviews.includes(:user).where(approved: true).order(created_at: :desc)
    @review = Review.new
    @similar_products = Product.where(category_id: @product.category_id, active: true).where.not(id: @product.id).limit(6)
    @popular_products = Product.where(active: true).order(created_at: :desc).limit(8)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ?  [["id", 16]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ? AND "reviews"."approved" = ? ORDER BY "reviews"."created_at" DESC  [["product_id", 5], ["approved", 1]]
SELECT "products".* FROM "products" WHERE "products"."active" = ? ORDER BY "products"."created_at" DESC LIMIT ?  [["active", 1], ["LIMIT", 8]]