app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)
    @user.email = @user.email.to_s.downcase.strip
    @user.role ||= "user"
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "dwef@gmail.com"], ["password_digest", "[FILTERED]"], ["role", 0], ["created_at", "2025-12-17 18:30:21.408752"], ["updated_at", "2025-12-17 18:30:21.408752"]]