app/controllers/reviews_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "product_id", "rating", "body", "approved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["product_id", 5], ["rating", 2], ["body", "3"], ["approved", 0], ["created_at", "2025-12-17 18:40:02.347153"], ["updated_at", "2025-12-17 18:40:02.347153"]]
---
  def create
    product = Product.find(params[:product_id])
    review = product.reviews.new(review_params.merge(user: current_user, approved: false))
    if review.save