app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email].to_s.downcase.strip)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin1234"], ["LIMIT", 1]]